<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="1" name="input.1" type="Parameter" version="opset1">
			<data shape="3,1,80,16" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input.1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input.1">
					<dim>3</dim>
					<dim>1</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="input.40" type="Parameter" version="opset1">
			<data shape="3,6,96,96" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input.40"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input.40">
					<dim>3</dim>
					<dim>6</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Multiply_12194" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 3, 3" offset="0" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Multiply_11690" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="354, 355, Concat_373, Convolution_354, Reshape_374, audio_encoder.0.conv_block.1.bias, audio_encoder.0.conv_block.1.running_mean, audio_encoder.0.conv_block.1.running_var, audio_encoder.0.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_11695" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="1152" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="355" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="354, 355, Concat_373, Reshape_374, audio_encoder.0.conv_block.1.bias, audio_encoder.0.conv_block.1.running_mean, audio_encoder.0.conv_block.1.running_var, audio_encoder.0.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="355">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="356" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="356"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="356">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Multiply_12203" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="1280" size="36864"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Multiply_11700" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="357, 358, Concat_423, Convolution_404, Reshape_424, audio_encoder.1.conv_block.1.bias, audio_encoder.1.conv_block.1.running_mean, audio_encoder.1.conv_block.1.running_var, audio_encoder.1.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_11705" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="38144" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="358" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="357, 358, Concat_423, Reshape_424, audio_encoder.1.conv_block.1.bias, audio_encoder.1.conv_block.1.running_mean, audio_encoder.1.conv_block.1.running_var, audio_encoder.1.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="358">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="359" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="359"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="359">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="360" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="360"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="360">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Multiply_12212" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="38272" size="36864"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Multiply_11710" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="361, 362, Concat_474, Convolution_455, Reshape_475, audio_encoder.2.conv_block.1.bias, audio_encoder.2.conv_block.1.running_mean, audio_encoder.2.conv_block.1.running_var, audio_encoder.2.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_11715" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="75136" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="362" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="361, 362, Concat_474, Reshape_475, audio_encoder.2.conv_block.1.bias, audio_encoder.2.conv_block.1.running_mean, audio_encoder.2.conv_block.1.running_var, audio_encoder.2.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="362">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="363" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="363"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="363">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="364" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="364"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="364">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Multiply_12221" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="75264" size="73728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Multiply_11720" type="Convolution" version="opset1">
			<data strides="3, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="365, 366, Concat_525, Convolution_506, Reshape_526, audio_encoder.3.conv_block.1.bias, audio_encoder.3.conv_block.1.running_mean, audio_encoder.3.conv_block.1.running_var, audio_encoder.3.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_11725" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="148992" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="366" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="365, 366, Concat_525, Reshape_526, audio_encoder.3.conv_block.1.bias, audio_encoder.3.conv_block.1.running_mean, audio_encoder.3.conv_block.1.running_var, audio_encoder.3.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="366">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="367" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="367"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="367">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Multiply_12230" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="149248" size="147456"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Multiply_11730" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="368, 369, Concat_575, Convolution_556, Reshape_576, audio_encoder.4.conv_block.1.bias, audio_encoder.4.conv_block.1.running_mean, audio_encoder.4.conv_block.1.running_var, audio_encoder.4.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_11735" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="296704" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="369" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="368, 369, Concat_575, Reshape_576, audio_encoder.4.conv_block.1.bias, audio_encoder.4.conv_block.1.running_mean, audio_encoder.4.conv_block.1.running_var, audio_encoder.4.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="369">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="370" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="370"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="370">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="371" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="371"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="371">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Multiply_12239" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="296960" size="147456"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Multiply_11740" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="372, 373, Concat_626, Convolution_607, Reshape_627, audio_encoder.5.conv_block.1.bias, audio_encoder.5.conv_block.1.running_mean, audio_encoder.5.conv_block.1.running_var, audio_encoder.5.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_11745" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="444416" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="373" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="372, 373, Concat_626, Reshape_627, audio_encoder.5.conv_block.1.bias, audio_encoder.5.conv_block.1.running_mean, audio_encoder.5.conv_block.1.running_var, audio_encoder.5.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="373">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="374" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="374"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="374">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="375" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="375"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="375">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Multiply_12248" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 3, 3" offset="444672" size="294912"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Multiply_11750" type="Convolution" version="opset1">
			<data strides="3, 3" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="376, 377, Concat_677, Convolution_658, Reshape_678, audio_encoder.6.conv_block.1.bias, audio_encoder.6.conv_block.1.running_mean, audio_encoder.6.conv_block.1.running_var, audio_encoder.6.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_11755" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="739584" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="377" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="376, 377, Concat_677, Reshape_678, audio_encoder.6.conv_block.1.bias, audio_encoder.6.conv_block.1.running_mean, audio_encoder.6.conv_block.1.running_var, audio_encoder.6.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="377">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="378" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="378"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="378">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Multiply_12257" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="740096" size="589824"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Multiply_11760" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="379, 380, Concat_727, Convolution_708, Reshape_728, audio_encoder.7.conv_block.1.bias, audio_encoder.7.conv_block.1.running_mean, audio_encoder.7.conv_block.1.running_var, audio_encoder.7.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_11765" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1329920" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="380" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="379, 380, Concat_727, Reshape_728, audio_encoder.7.conv_block.1.bias, audio_encoder.7.conv_block.1.running_mean, audio_encoder.7.conv_block.1.running_var, audio_encoder.7.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="380">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="381" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="381"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="381">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="382" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="382"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="382">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Multiply_12266" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="1330432" size="589824"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Multiply_11770" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="383, 384, Concat_778, Convolution_759, Reshape_779, audio_encoder.8.conv_block.1.bias, audio_encoder.8.conv_block.1.running_mean, audio_encoder.8.conv_block.1.running_var, audio_encoder.8.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_11775" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1920256" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="384" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="383, 384, Concat_778, Reshape_779, audio_encoder.8.conv_block.1.bias, audio_encoder.8.conv_block.1.running_mean, audio_encoder.8.conv_block.1.running_var, audio_encoder.8.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="384">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="385" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="385"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="385">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="386" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="386"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="386">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Multiply_12275" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="1920768" size="1179648"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Multiply_11780" type="Convolution" version="opset1">
			<data strides="3, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="387, 388, Concat_829, Convolution_810, Reshape_830, audio_encoder.9.conv_block.1.bias, audio_encoder.9.conv_block.1.running_mean, audio_encoder.9.conv_block.1.running_var, audio_encoder.9.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_11785" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="3100416" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="388" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="387, 388, Concat_829, Reshape_830, audio_encoder.9.conv_block.1.bias, audio_encoder.9.conv_block.1.running_mean, audio_encoder.9.conv_block.1.running_var, audio_encoder.9.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="388">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="389" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="389"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="389">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Multiply_12284" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 3, 3" offset="3101440" size="2359296"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Multiply_11790" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="390, 391, Concat_879, Convolution_860, Reshape_880, audio_encoder.10.conv_block.1.bias, audio_encoder.10.conv_block.1.running_mean, audio_encoder.10.conv_block.1.running_var, audio_encoder.10.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_11795" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="5460736" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="391" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="390, 391, Concat_879, Reshape_880, audio_encoder.10.conv_block.1.bias, audio_encoder.10.conv_block.1.running_mean, audio_encoder.10.conv_block.1.running_var, audio_encoder.10.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="391">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="392" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="392"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="392">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="393" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="393"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="393">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Multiply_12293" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 3, 3" offset="5461760" size="4718592"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Multiply_11800" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="394, 395, Concat_930, Convolution_911, Reshape_931, audio_encoder.11.conv_block.1.bias, audio_encoder.11.conv_block.1.running_mean, audio_encoder.11.conv_block.1.running_var, audio_encoder.11.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_11805" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="10180352" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="395" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="394, 395, Concat_930, Reshape_931, audio_encoder.11.conv_block.1.bias, audio_encoder.11.conv_block.1.running_mean, audio_encoder.11.conv_block.1.running_var, audio_encoder.11.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="395">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="396" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="396"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="396">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Multiply_12302" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 1, 1" offset="10182400" size="1048576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Multiply_11810" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="397, 398, Concat_980, Convolution_961, Reshape_981, audio_encoder.12.conv_block.1.bias, audio_encoder.12.conv_block.1.running_mean, audio_encoder.12.conv_block.1.running_var, audio_encoder.12.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_11815" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="11230976" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="398" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="397, 398, Concat_980, Reshape_981, audio_encoder.12.conv_block.1.bias, audio_encoder.12.conv_block.1.running_mean, audio_encoder.12.conv_block.1.running_var, audio_encoder.12.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="398">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="399" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="399"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="399">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Multiply_12311" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 1, 1" offset="11233024" size="1048576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Multiply_11820" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="464, 465, Concat_1940, Convolution_1921, Reshape_1941, face_decoder_blocks.0.0.conv_block.1.bias, face_decoder_blocks.0.0.conv_block.1.running_mean, face_decoder_blocks.0.0.conv_block.1.running_var, face_decoder_blocks.0.0.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_11825" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="12281600" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="465" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="464, 465, Concat_1940, Reshape_1941, face_decoder_blocks.0.0.conv_block.1.bias, face_decoder_blocks.0.0.conv_block.1.running_mean, face_decoder_blocks.0.0.conv_block.1.running_var, face_decoder_blocks.0.0.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="465">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="466" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="466"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="466">
					<dim>3</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Multiply_12320" type="Const" version="opset1">
			<data element_type="f32" shape="16, 6, 7, 7" offset="12283648" size="18816"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>6</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Multiply_11830" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="400, 401, Concat_1030, Convolution_1011, Reshape_1031, face_encoder_blocks.0.0.conv_block.1.bias, face_encoder_blocks.0.0.conv_block.1.running_mean, face_encoder_blocks.0.0.conv_block.1.running_var, face_encoder_blocks.0.0.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>6</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>6</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_11835" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="12302464" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="401" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="400, 401, Concat_1030, Reshape_1031, face_encoder_blocks.0.0.conv_block.1.bias, face_encoder_blocks.0.0.conv_block.1.running_mean, face_encoder_blocks.0.0.conv_block.1.running_var, face_encoder_blocks.0.0.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="401">
					<dim>3</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="402" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="402"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="402">
					<dim>3</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Multiply_12329" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 3, 3" offset="12302528" size="18432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Multiply_11840" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="403, 404, Concat_1080, Convolution_1061, Reshape_1081, face_encoder_blocks.1.0.conv_block.1.bias, face_encoder_blocks.1.0.conv_block.1.running_mean, face_encoder_blocks.1.0.conv_block.1.running_var, face_encoder_blocks.1.0.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_11845" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="12320960" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="404" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="403, 404, Concat_1080, Reshape_1081, face_encoder_blocks.1.0.conv_block.1.bias, face_encoder_blocks.1.0.conv_block.1.running_mean, face_encoder_blocks.1.0.conv_block.1.running_var, face_encoder_blocks.1.0.conv_block.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="404">
					<dim>3</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="405" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="405"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="405">
					<dim>3</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Multiply_12338" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 3, 3" offset="12321088" size="36864"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Multiply_11850" type="Convolution" version="opset1">
